OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1713.h
#define _G1PHF0                 0x01
#define _G1PHF1                 0x02
#define _G1PHF2                 0x04
#define _G1PHF3                 0x08
#define _G1PHF4                 0x10
#define _G1PHF5                 0x20

//==============================================================================


//==============================================================================
//        COG1BLKR Bits

extern __at(0x0693) __sfr COG1BLKR;

typedef union
  {
  struct
    {
    unsigned G1BLKR0            : 1;
    unsigned G1BLKR1            : 1;
    unsigned G1BLKR2            : 1;
    unsigned G1BLKR3            : 1;
    unsigned G1BLKR4            : 1;
    unsigned G1BLKR5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G1BLKR             : 6;
    unsigned                    : 2;
    };
  } __COG1BLKRbits_t;

extern __at(0x0693) volatile __COG1BLKRbits_t COG1BLKRbits;

#define _G1BLKR0                0x01
#define _G1BLKR1                0x02
#define _G1BLKR2                0x04
#define _G1BLKR3                0x08
#define _G1BLKR4                0x10
#define _G1BLKR5                0x20

//==============================================================================


//==============================================================================
//        COG1BLKF Bits

extern __at(0x0694) __sfr COG1BLKF;

typedef union
  {
  struct
    {
    unsigned G1BLKF0            : 1;
    unsigned G1BLKF1            : 1;
    unsigned G1BLKF2            : 1;
    unsigned G1BLKF3            : 1;
    unsigned G1BLKF4            : 1;
    unsigned G1BLKF5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G1BLKF             : 6;
    unsigned                    : 2;
    };
  } __COG1BLKFbits_t;

extern __at(0x0694) volatile __COG1BLKFbits_t COG1BLKFbits;

#define _G1BLKF0                0x01
#define _G1BLKF1                0x02
#define _G1BLKF2                0x04
#define _G1BLKF3                0x08
#define _G1BLKF4                0x10
#define _G1BLKF5                0x20

//==============================================================================


//==============================================================================
//        COG1DBR Bits

extern __at(0x0695) __sfr COG1DBR;

typedef union
  {
  struct
    {
    unsigned G1DBR0             : 1;
    unsigned G1DBR1             : 1;
    unsigned G1DBR2             : 1;
    unsigned G1DBR3             : 1;
    unsigned G1DBR4             : 1;
    unsigned G1DBR5             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G1DBR              : 6;
    unsigned                    : 2;
    };
  } __COG1DBRbits_t;

extern __at(0x0695) volatile __COG1DBRbits_t COG1DBRbits;

#define _G1DBR0                 0x01
#define _G1DBR1                 0x02
#define _G1DBR2                 0x04
#define _G1DBR3                 0x08
#define _G1DBR4                 0x10
#define _G1DBR5                 0x20

//==============================================================================


//==============================================================================
//        COG1DBF Bits

extern __at(0x0696) __sfr COG1DBF;

typedef union
  {
  struct
    {
    unsigned G1DBF0             : 1;
    unsigned G1DBF1             : 1;
    unsigned G1DBF2             : 1;
    unsigned G1DBF3             : 1;
    unsigned G1DBF4             : 1;
    unsigned G1DBF5             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G1DBF              : 6;
    unsigned                    : 2;
    };
  } __COG1DBFbits_t;

extern __at(0x0696) volatile __COG1DBFbits_t COG1DBFbits;

#define _G1DBF0                 0x01
#define _G1DBF1                 0x02
#define _G1DBF2                 0x04
#define _G1DBF3                 0x08
#define _G1DBF4                 0x10
#define _G1DBF5                 0x20

//==============================================================================


//==============================================================================
//        COG1CON0 Bits

extern __at(0x0697) __sfr COG1CON0;

typedef union
  {
  struct
    {
    unsigned G1MD0              : 1;
    unsigned G1MD1              : 1;
    unsigned G1MD2              : 1;
    unsigned G1CS0              : 1;
    unsigned G1CS1              : 1;
    unsigned                    : 1;
    unsigned G1LD               : 1;
    unsigned G1EN               : 1;
    };

  struct
    {
    unsigned G1MD               : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned                    : 3;
    unsigned G1CS               : 2;
    unsigned                    : 3;
    };
  } __COG1CON0bits_t;

extern __at(0x0697) volatile __COG1CON0bits_t COG1CON0bits;

#define _G1MD0                  0x01
#define _G1MD1                  0x02
#define _G1MD2                  0x04
#define _G1CS0                  0x08
#define _G1CS1                  0x10
#define _G1LD                   0x40
#define _G1EN                   0x80

//==============================================================================


//==============================================================================
//        COG1CON1 Bits

extern __at(0x0698) __sfr COG1CON1;

typedef struct
  {
  unsigned G1POLA               : 1;
  unsigned G1POLB               : 1;
  unsigned G1POLC               : 1;
  unsigned G1POLD               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned G1FDBS               : 1;
  unsigned G1RDBS               : 1;
  } __COG1CON1bits_t;

extern __at(0x0698) volatile __COG1CON1bits_t COG1CON1bits;

#define _G1POLA                 0x01
#define _G1POLB                 0x02
#define _G1POLC                 0x04
#define _G1POLD                 0x08
#define _G1FDBS                 0x40
#define _G1RDBS                 0x80

//==============================================================================


//==============================================================================
//        COG1RIS Bits

extern __at(0x0699) __sfr COG1RIS;

typedef struct
  {
  unsigned G1RIS0               : 1;
  unsigned G1RIS1               : 1;
  unsigned G1RIS2               : 1;
  unsigned G1RIS3               : 1;
  unsigned G1RIS4               : 1;
  unsigned G1RIS5               : 1;
  unsigned G1RIS6               : 1;
  unsigned G1RIS7               : 1;
  } __COG1RISbits_t;

